# Taps
tap 'homebrew/cask-cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'php@7.2'
brew 'php@7.3'
brew 'mysql@5.7'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'appzapper'
cask 'discord'
cask 'docker'
cask 'evernote'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'spectacle'
cask 'sublime-text'
cask 'tableplus'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'tower2'
cask 'transmit'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'wkhtmltopdf'
cask 'plex-media-player'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Tweetbot', id: 557168941
mas 'Medis', id: 1063631769
