# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'exolnet/homebrew-deprecated'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'unrar'
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'composer'
brew 'node'

# Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Apps
cask '1password'
cask '1password-cli'
cask 'adobe-creative-cloud'
cask 'affinity-designer'
cask 'affinity-photo'
cask 'affinity-publisher'
cask 'appzapper'
cask 'capacities'
cask 'devutils'
cask 'discord'
cask 'dropbox'
cask 'evernote'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'herd'
cask 'insomnia'
cask 'iterm2'
cask 'lightburn'
cask 'nordvpn'
cask 'phpstorm'
cask 'plex'
cask 'ray'
cask 'raycast'
cask 'rectangle'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tower'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wkhtmltopdf'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
mas 'DaisyDisk', id: 411643860
mas 'Medis', id: 1579200037
mas 'Twitter', id: 1482454543
